twitter_altcad_api/app/controllers/api/v1/authentication_controller.rb

      def login
        @user = User.find_by(email: login_params[:email]) # Or username, adapt login_params
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'john@example.com' LIMIT 1